Revit 2027 API
RevisionNumberingSequence.SetNumericRevisionSettings Method
 Replaces the current numeric revision numbering settings with the provided settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetNumericRevisionSettings(
	NumericRevisionSettings settings
)
Public Sub SetNumericRevisionSettings (
	settings As NumericRevisionSettings
)
public:
void SetNumericRevisionSettings(
	NumericRevisionSettings^ settings
)
member SetNumericRevisionSettings :
        settings : NumericRevisionSettings -> unit
Parameters
settings NumericRevisionSettings
 The NumericRevisionSettings to be applied to numeric revision numbering.
Exceptions
Exception | Condition
ArgumentException |  settings is not a valid NumericRevisionSettings.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace